# TASK #1: DEFINE SINGLE AND MULTI-DIMENSIONAL  NUMPY ARRAYS

In [2]:
# NumPy is a Linear Algebra Library used for multidimensional arrays
# NumPy brings the best of two worlds: (1) C/Fortran computational efficiency, (2) Python language easy syntax 
import numpy as np

# Let's define a one-dimensional array 
list_1 = [50, 60, 80, 70, 90]
list_1

[50, 60, 80, 70, 90]

In [6]:
# Let's create a numpy array from the list "my_list"

my_nparray = np.array(list_1)
my_nparray

array([50, 60, 80, 70, 90])

In [8]:
type(my_nparray)

numpy.ndarray

In [11]:
# Multi-dimensional (Matrix definition) 
my_matrix = np.array([[1,2,3], [4,5,6]])

my_matrix

array([[1, 2, 3],
       [4, 5, 6]])

MINI CHALLENGE #1: 
- Write a code that creates the following 2x4 numpy array

```
[[3 7 9 3] 
[4 3 2 2]]
```

In [12]:
challenge = np.array([[3,7,9,3], [4,3,2,2]])
challenge

array([[3, 7, 9, 3],
       [4, 3, 2, 2]])

# TASK #2: LEVERAGE NUMPY BUILT-IN METHODS AND FUNCTIONS

In [14]:
# "rand()" uniform distribution between 0 and 1

x = np.random.rand(20)
x

array([0.33487297, 0.70954506, 0.15043728, 0.59647134, 0.98497841,
       0.62679826, 0.73243005, 0.88047239, 0.90593801, 0.3189723 ,
       0.36790616, 0.67497149, 0.65453283, 0.91340621, 0.80851799,
       0.19291115, 0.65702398, 0.44741404, 0.22348042, 0.86263132])

In [15]:
# you can create a matrix of random number as well

x = np.random.rand(3, 3)
x

array([[0.56066012, 0.00164558, 0.46767813],
       [0.84612176, 0.96575227, 0.25380816],
       [0.52616903, 0.94672042, 0.43403307]])

In [21]:
# "randint" is used to generate random integers between upper and lower bounds
x = np.random.randint(1, 50)
x

2

In [24]:
# "randint" can be used to generate a certain number of random itegers as follows

x = np.random.randint(1, 50, 15)
x

array([16, 17, 31, 37, 44, 24, 42,  5, 25, 10, 29,  4, 19,  7, 31])

In [26]:
# np.arange creates an evenly spaced values within a given interval

x = np.arange(1,51)
x

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50])

In [27]:
# create a diagonal of ones and zeros everywhere else
x = np.eye(7)
x

array([[1., 0., 0., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0., 0., 0.],
       [0., 0., 1., 0., 0., 0., 0.],
       [0., 0., 0., 1., 0., 0., 0.],
       [0., 0., 0., 0., 1., 0., 0.],
       [0., 0., 0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 0., 0., 1.]])

In [28]:
# Matrix of ones
x = np.ones((7, 7))
x

array([[1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1.]])

In [29]:
# Array of zeros
x = np.zeros((7, 7))
x

array([[0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0.]])

MINI CHALLENGE #2:
- Write a code that takes in a positive integer "x" from the user and creates a 1x10 array with random numbers ranging from 0 to "x"

In [32]:
x = int(input("Selecciona un número: "))
challenge =  np.random.randint(0, x, 10)
challenge

Selecciona un número: 21

array([ 4, 19, 17,  7,  5,  3, 10,  4, 15, 20])

# TASK #3: PERFORM MATHEMATICAL OPERATIONS IN NUMPY

In [82]:
# np.arange() returns an evenly spaced values within a given interval
x = np.arange(1, 11)
x

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [34]:
y = np.arange(1, 11)
x

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [ ]:
# Add 2 numpy arrays together
sum = x+y
sum

In [42]:
al_cuadrado = x**2
al_cuadrado

array([  1,   4,   9,  16,  25,  36,  49,  64,  81, 100], dtype=int32)

In [43]:
raiz_cuadrada = np.sqrt(al_cuadrado)
raiz_cuadrada

array([ 1.,  2.,  3.,  4.,  5.,  6.,  7.,  8.,  9., 10.])

In [44]:
z = np.exp(y)
z

array([2.71828183e+00, 7.38905610e+00, 2.00855369e+01, 5.45981500e+01,
       1.48413159e+02, 4.03428793e+02, 1.09663316e+03, 2.98095799e+03,
       8.10308393e+03, 2.20264658e+04])

MINI CHALLENGE #3:
- Given the X and Y values below, obtain the distance between them

```
X = [5, 7, 20]
Y = [9, 15, 4]
```

In [54]:
X = np.array([5, 7, 20])
Y = np.array([9, 15, 4])

# How to calculate distance:
z = np.sqrt(X**2 + Y**2)
print("Esta es la distancia entre los dos arreglos: {}".format(z))


# Euclidean distance
e = X-Y
e_dist = np.linalg.norm(e)
print("Esta es la Euclidean distance: {}" .format(e_dist))

Esta es la distancia entre los dos arreglos: [10.29563014 16.55294536 20.39607805]
Esta es la Euclidean distance: 18.33030277982336

# TASK #4: PERFORM ARRAYS SLICING AND INDEXING

In [55]:
my_coso = np.array([3,5,6,2,8,10,20,50])
my_coso

array([ 3,  5,  6,  2,  8, 10, 20, 50])

In [62]:
# Access specific index from the numpy array
my_coso[-4]

8

In [63]:
# Starting from the first index 0 up until and NOT including the last element
my_coso[0:3]

array([3, 5, 6])

In [65]:
# Broadcasting, altering several values in a numpy array at once
# Transmisión, altera varios valores in un arreglo numpy de una vez
my_coso[0:4] = 7
my_coso

array([ 7,  7,  7,  7,  8, 10, 20, 50])

In [71]:
# Let's define a two dimensional numpy array
# Creación aleatoria de una matrix 4x4 (desde, hasta, (filas, columnas))
matrix = np.random.randint(1,10, (4,4))
matrix

array([[2, 7, 5, 8],
       [9, 9, 4, 3],
       [7, 6, 6, 7],
       [2, 5, 8, 8]])

In [73]:
# Get a row from a mtrix
# Obtener la columna de una matrix (vertical)
matrix[3]

array([2, 5, 8, 8])

In [77]:
# Get one element
# Obtener un elmento especifico dentro de la matrix
# Se busca por sus indices de número de fila y número de columna
matrix[2][-2]

6

MINI CHALLENGE #4:
- In the following matrix, replace the last row with 0

```
X = [2 30 20 -2 -4]
    [3 4  40 -3 -2]
    [-3 4 -6 90 10]
    [25 45 34 22 12]
    [13 24 22 32 37]
```

In [81]:
X = np.array([[2, 30, 20, -2, -4],
            [3, 4,  40, -3, -2],
            [-3, 4, -6, 90, 10],
            [25, 45, 34, 22, 12],
            [13, 24, 22, 32, 37]])
    
X[-1] = 0
X

array([[ 2, 30, 20, -2, -4],
       [ 3,  4, 40, -3, -2],
       [-3,  4, -6, 90, 10],
       [25, 45, 34, 22, 12],
       [ 0,  0,  0,  0,  0]])

# TASK #5: PERFORM ELEMENTS SELECTION (CONDITIONAL)

In [83]:
matrix = np.random.randint(1, 10,(5,5))
matrix

array([[9, 1, 9, 4, 7],
       [9, 5, 7, 6, 5],
       [7, 9, 5, 4, 4],
       [6, 1, 5, 9, 6],
       [1, 2, 5, 7, 4]])

In [84]:
# Busca dentro de la matrix solo los elementos que tenga un valor mayor a 7
new_matrix = matrix[matrix > 7]
new_matrix

array([9, 9, 9, 9, 9])

In [85]:
# Obtain odd elements only | Buscar sólo números pares
new_matrix = matrix[matrix % 2 ==1]
new_matrix

array([9, 1, 9, 7, 9, 5, 7, 5, 7, 9, 5, 1, 5, 9, 1, 5, 7])

MINI CHALLENGE #5:
- In the following matrix, replace negative elements by 0 and replace odd elements with -2


```
X = [2 30 20 -2 -4]
    [3 4  40 -3 -2]
    [-3 4 -6 90 10]
    [25 45 34 22 12]
    [13 24 22 32 37]
```

In [3]:
x = np.array([[[2, 30, 20, -2, -4],
                [3, 4,  40, -3, -2],
                [-3, 4, -6, 90, 10],
                [25, 45, 34, 22, 12],
                [13, 24, 22, 32, 37]]])

x[x<0]=0
x[x%2==1] = -2
x

array([[[ 2, 30, 20,  0,  0],
        [-2,  4, 40,  0,  0],
        [ 0,  4,  0, 90, 10],
        [-2, -2, 34, 22, 12],
        [-2, 24, 22, 32, -2]]])

# TASK #6: UNDERSTAND PANDAS FUNDAMENTALS

In [ ]:
# Pandas is a data manipulation and analysis tool that is built on Numpy.
# Pandas uses a data structure known as DataFrame (think of it as Microsoft excel in Python). 
# DataFrames empower programmers to store and manipulate data in a tabular fashion (rows and columns).
# Series Vs. DataFrame? Series is considered a single column of a DataFrame.

In [2]:
import pandas as pd

In [16]:
# Let's define a two-dimensional Pandas DataFrame
# Note that you can create a pandas dataframe from a python dictionary
bank_df = pd.DataFrame({'Bank Client ID': [111, 222,333,444],
                        'Bank Client Name':['Chanel', 'Steve', 'Mitch', 'Ryan'],
                        'Net Worth[$]': [3500, 2900, 10000, 2000],
                        'Years With Bank':[3,4,9,5]})
bank_df

array([[111, 'Chanel', 3500, 3],
       [222, 'Steve', 2900, 4],
       [333, 'Mitch', 10000, 9],
       [444, 'Ryan', 2000, 5]], dtype=object)

In [6]:
# Let's obtain the data type 
type(bank_df)

pandas.core.frame.DataFrame

In [7]:
# you can only view the first couple of rows using .head()
bank_df.head(2)

   Bank Client ID Bank Client Name  Net Worth[$]  Years With Bank
0             111           Chanel          3500                3
1             222            Steve          2900                4

In [8]:
# you can only view the last couple of rows using .tail()
bank_df.tail(2)

   Bank Client ID Bank Client Name  Net Worth[$]  Years With Bank
2             333            Mitch         10000                9
3             444             Ryan          2000                5

MINI CHALLENGE #6:
- A porfolio contains a collection of securities such as stocks, bonds and ETFs. Define a dataframe named 'portfolio_df' that holds 3 different stock ticker symbols, number of shares, and price per share (feel free to choose any stocks)
- Calculate the total value of the porfolio including all stocks

In [4]:
portfolio_df = pd.DataFrame({'Stock Name': ['Apple', 'Advanced Micro Devices','Amazon',"Tesla"],
                            'Symbol':['AAPL', 'AMD', 'AMZN', 'TSLA'],
                             'Quantity':[5, 2, 3, 5],
                        'Last Price[$]': [159.25, 98.82, 97.32, 190.50],
                        'Share Volume':[6.472, 8.570, 8.095, 16.676]})

activos = portfolio_df['Last Price[$]']*portfolio_df['Quantity']
portfolio_value = activos.sum()
print(f'Portafolio valuado en {round(portfolio_value)}$')
portfolio_df

Portafolio valuado en 2238$

               Stock Name Symbol  Quantity  Last Price[$]  Share Volume
0                   Apple   AAPL         5         159.25         6.472
1  Advanced Micro Devices    AMD         2          98.82         8.570
2                  Amazon   AMZN         3          97.32         8.095
3                   Tesla   TSLA         5         190.50        16.676

# TASK #7: PANDAS WITH CSV AND HTML DATA

In [8]:
# Pandas is used to read a csv file and store data in a DataFrame
precio_casas = pd.read_html('https://www.livingin-canada.com/house-prices-canada.html')
precio_casas[0]
precio_casas[1]

,Province,Average House Price,12 Month Change
0,British Columbia,"$736,000",+ 7.6 %
1,Ontario,"$594,000",– 3.2 %
2,Alberta,"$353,000",– 7.5 %
3,Quebec,"$340,000",+ 7.6 %
4,Manitoba,"$295,000",– 1.4 %
5,Saskatchewan,"$271,000",– 3.8 %
6,Nova Scotia,"$266,000",+ 3.5 %
7,Prince Edward Island,"$243,000",+ 3.0 %
8,Newfoundland / Labrador,"$236,000",– 1.6 %
9,New Brunswick,"$183,000",– 2.2 %
10,Canadian Average,"$488,000",– 1.3 %
11,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...

In [ ]:
# Read tabular data using read_html

In [10]:
datos_retiro = pd.read_html('https://www.ssa.gov/oact/progdata/nra.html')
datos_retiro[0]

,Year of birth,Age
0,1937 and prior,65
1,1938,65 and 2 months
2,1939,65 and 4 months
3,1940,65 and 6 months
4,1941,65 and 8 months
5,1942,65 and 10 months
6,1943-54,66
7,1955,66 and 2 months
8,1956,66 and 4 months
9,1957,66 and 6 months
10,1958,66 and 8 months
11,1959,66 and 10 months
12,1960 and later,67
13,Notes: 1. Persons born on January 1 of any yea...,Notes: 1. Persons born on January 1 of any yea...

MINI CHALLENGE #7:
- Write a code that uses Pandas to read tabular US retirement data
- You can use data from here: https://www.ssa.gov/oact/progdata/nra.html
- Leer desde un excel

In [12]:
helaos = pd.read_excel('/home/reithe/Documentos/learn/LatamCaribbeanPopulation.xlsx')
helaos

,Nombre de serie,Código de serie,Nombre del país,Código del país,2010 [YR2010],2011 [YR2011],2012 [YR2012],2013 [YR2013],2014 [YR2014],2015 [YR2015],2016 [YR2016],2017 [YR2017],2018 [YR2018],2019 [YR2019],Unnamed: 14,Unnamed: 15
0,"Población, total",SP.POP.TOTL,Antigua y Barbuda,ATG,88028.0,89253.0,90409.0,91516.0,92562.0,93566.0,94527.0,95426.0,96286.0,97118.0,NaN,NaN
1,"Población, total",SP.POP.TOTL,Argentina,ARG,40788453.0,41261490.0,41733271.0,42202935.0,42669500.0,43131966.0,43590368.0,44044811.0,44494502.0,44938712.0,NaN,NaN
2,"Población, total",SP.POP.TOTL,Aruba,ABW,101669.0,102046.0,102560.0,103159.0,103774.0,104341.0,104872.0,105366.0,105845.0,106314.0,NaN,NaN
3,"Población, total",SP.POP.TOTL,Bahamas,BHS,354942.0,359577.0,363584.0,367168.0,370633.0,374206.0,377931.0,381761.0,385640.0,389482.0,NaN,
4,"Población, total",SP.POP.TOTL,Barbados,BRB,282131.0,282987.0,283700.0,284296.0,284825.0,285324.0,285796.0,286233.0,286641.0,287025.0,NaN,NaN
5,"Población, total",SP.POP.TOTL,Belice,BLZ,322464.0,330237.0,338000.0,345715.0,353366.0,360933.0,368400.0,375769.0,383071.0,390353.0,NaN,NaN
6,"Población, total",SP.POP.TOTL,Bolivia,BOL,10048590.0,10212954.0,10377676.0,10542376.0,10706517.0,10869730.0,11031813.0,11192854.0,11353142.0,11513100.0,NaN,NaN
7,"Población, total",SP.POP.TOTL,Brasil,BRA,195713635.0,197514534.0,199287296.0,201035903.0,202763735.0,204471769.0,206163058.0,207833831.0,209469333.0,211049527.0,NaN,NaN
8,"Población, total",SP.POP.TOTL,Islas Vírgenes Británicas,VGB,27794.0,28319.0,28650.0,28847.0,28989.0,29152.0,29355.0,29577.0,29802.0,30030.0,NaN,NaN
9,"Población, total",SP.POP.TOTL,Islas Caimán,CYM,56672.0,57878.0,58958.0,59932.0,60848.0,61724.0,62569.0,63382.0,64174.0,64948.0,NaN,NaN
10,"Población, total",SP.POP.TOTL,Chile,CHL,17062536.0,17233576.0,17400347.0,17571507.0,17758959.0,17969353.0,18209068.0,18470439.0,18729160.0,18952038.0,NaN,NaN
11,"Población, total",SP.POP.TOTL,Colombia,COL,45222700.0,45663099.0,46076848.0,46497267.0,46969209.0,47520667.0,48171392.0,48901066.0,49648685.0,50339443.0,NaN,NaN
12,"Población, total",SP.POP.TOTL,Costa Rica,CRI,4577378.0,4633086.0,4688000.0,4742107.0,4795396.0,4847804.0,4899345.0,4949954.0,4999441.0,5047561.0,NaN,NaN
13,"Población, total",SP.POP.TOTL,Cuba,CUB,11225832.0,11236670.0,11257101.0,11282720.0,11306902.0,11324781.0,11335109.0,11339259.0,11338138.0,11333483.0,NaN,NaN
14,"Población, total",SP.POP.TOTL,Curazao,CUW,148703.0,150831.0,152088.0,153822.0,155909.0,157980.0,159664.0,160175.0,159800.0,157538.0,NaN,NaN
15,"Población, total",SP.POP.TOTL,Dominica,DMA,70878.0,70916.0,70965.0,71016.0,71085.0,71183.0,71307.0,71458.0,71625.0,71808.0,NaN,NaN
16,"Población, total",SP.POP.TOTL,República Dominicana,DOM,9695121.0,9813210.0,9930911.0,10048224.0,10165178.0,10281680.0,10397743.0,10513131.0,10627165.0,10738958.0,NaN,NaN
17,"Población, total",SP.POP.TOTL,Ecuador,ECU,15011117.0,15243883.0,15474102.0,15707474.0,15951838.0,16212020.0,16491115.0,16785361.0,17084357.0,17373662.0,NaN,NaN
18,"Población, total",SP.POP.TOTL,El Salvador,SLV,6183875.0,6210568.0,6237923.0,6266070.0,6295128.0,6325124.0,6356143.0,6388122.0,6420744.0,6453553.0,NaN,NaN
19,"Población, total",SP.POP.TOTL,Granada,GRD,106233.0,106796.0,107446.0,108170.0,108902.0,109599.0,110261.0,110874.0,111454.0,112003.0,NaN,NaN
20,"Población, total",SP.POP.TOTL,Guatemala,GTM,14259687.0,14521515.0,14781942.0,15043981.0,15306316.0,15567419.0,15827690.0,16087418.0,16346950.0,16604026.0,NaN,NaN
21,"Población, total",SP.POP.TOTL,Guyana,GUY,749436.0,752028.0,755399.0,759285.0,763380.0,767432.0,771366.0,775221.0,779004.0,782766.0,NaN,NaN
22,"Población, total",SP.POP.TOTL,Haití,HTI,9949322.0,10100320.0,10250930.0,10400673.0,10549008.0,10695542.0,10839970.0,10982366.0,11123176.0,11263077.0,NaN,NaN
23,"Población, total",SP.POP.TOTL,Honduras,HND,8317470.0,8480671.0,8640691.0,8798521.0,8955589.0,9112916.0,9270795.0,9429013.0,9587522.0,9746117.0,NaN,NaN
24,"Población, total",SP.POP.TOTL,Jamaica,JAM,2810460.0,2825929.0,2842132.0,2858709.0,2875136.0,2891021.0,2906238.0,2920853.0,2934855.0,2948279.0,NaN,NaN
25,"Población, total",SP.POP.TOTL,México,MEX,114092963.0,115695473.0,117274155.0,118827161.0,120355128.0,121858258.0,123333376.0,124777324.0,126190788.0,127575529.0,NaN,NaN
26,"Población, total",SP.POP.TOTL,Nicaragua,NIC,5824065.0,5903039.0,5982526.0,6062454.0,6142733.0,6223240.0,6303974.0,6384855.0,6465513.0,6545502.0,NaN,NaN
27,"Población, total",SP.POP.TOTL,Panamá,PAN,3642687.0,3706483.0,3770624.0,3835437.0,3901315.0,3968487.0,4037078.0,4106771.0,4176873.0,4246439.0,NaN,NaN
28,"Población, total",SP.POP.TOTL,Paraguay,PRY,6248020.0,6333976.0,6421512.0,6510276.0,6599526.0,6688746.0,6777872.0,6867062.0,6956071.0,7044636.0,NaN,NaN
29,"Población, total",SP.POP.TOTL,Perú,PER,29027674.0,29264318.0,29506788.0,29773987.0,30090359.0,30470734.0,30926032.0,31444297.0,31989256.0,32510453.0,NaN,NaN
30,"Población, total",SP.POP.TOTL,Puerto Rico,PRI,3721525.0,3678732.0,3634488.0,3593077.0,3534874.0,3473232.0,3406672.0,3325286.0,3193354.0,3193694.0,NaN,NaN
31,"Población, total",SP.POP.TOTL,San Martín (territorio holandés),SXM,34056.0,33435.0,34640.0,36607.0,37685.0,38825.0,39969.0,40574.0,40654.0,40733.0,NaN,NaN
32,"Población, total",SP.POP.TOTL,San Cristóbal y Nieves,KNA,49016.0,49447.0,49887.0,50331.0,50774.0,51203.0,51625.0,52045.0,52441.0,52823.0,NaN,NaN
33,"Población, total",SP.POP.TOTL,St. Lucia,LCA,174085.0,175544.0,176646.0,177513.0,178296.0,179126.0,180024.0,180955.0,181889.0,182790.0,NaN,NaN
34,"Población, total",SP.POP.TOTL,San Martín (territorio francés),MAF,37582.0,37446.0,37009.0,36453.0,36015.0,35858.0,36065.0,36560.0,37264.0,38002.0,NaN,NaN
35,"Población, total",SP.POP.TOTL,San Vicente y las Granadinas,VCT,108255.0,108316.0,108435.0,108622.0,108861.0,109148.0,109459.0,109827.0,110210.0,110589.0,NaN,NaN
36,"Población, total",SP.POP.TOTL,Surinam,SUR,529131.0,535179.0,541245.0,547291.0,553273.0,559143.0,564888.0,570496.0,575991.0,581372.0,NaN,NaN
37,"Población, total",SP.POP.TOTL,Trinidad y Tobago,TTO,1328147.0,1336178.0,1344817.0,1353700.0,1362342.0,1370328.0,1377564.0,1384072.0,1389858.0,1394973.0,NaN,NaN
38,"Población, total",SP.POP.TOTL,Islas Turcas y Caicos,TCA,32660.0,33377.0,34066.0,34731.0,35369.0,35981.0,36559.0,37115.0,37665.0,38191.0,NaN,NaN
39,"Población, total",SP.POP.TOTL,Uruguay,URY,3359275.0,3368934.0,3378974.0,3389439.0,3400434.0,3412009.0,3424132.0,3436646.0,3449299.0,3461734.0,NaN,NaN
40,"Población, total",SP.POP.TOTL,"Venezuela, RB",VEN,28439940.0,28888369.0,29362449.0,29783571.0,30045134.0,30081829.0,29846179.0,29390409.0,28870195.0,28515829.0,NaN,NaN
41,"Población, total",SP.POP.TOTL,Islas Vírgenes (Estados Unidos),VIR,108358.0,108292.0,108191.0,108044.0,107884.0,107710.0,107510.0,107268.0,106977.0,106631.0,NaN,NaN
42,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
43,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
44,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
45,Datos de base de datos: Indicadores del desarr...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
46,Última actualización: 07/01/2020,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

# TASK #8: PANDAS OPERATIONS

In [18]:
# Let's define a dataframe as follows:
bank_client_df = pd.DataFrame({'Bank client ID':[111, 222, 333, 444], 
                               'Bank Client Name':['Chanel', 'Steve', 'Mitch', 'Ryan'], 
                               'Net worth [$]':[3500, 29000, 10000, 2000], 
                               'Years with bank':[3, 4, 9, 5]})
bank_client_df

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
0             111           Chanel           3500                3
1             222            Steve          29000                4
2             333            Mitch          10000                9
3             444             Ryan           2000                5

In [ ]:
# Pick certain rows that satisfy a certain criteria 
df_loyal = bank_client_df[bank_client_df['Years with bank'] >=5]
df_loyal

In [19]:
# Delete a column from a DataFrame
del bank_client_df['Bank client ID']
bank_client_df

  Bank Client Name  Net worth [$]  Years with bank
0           Chanel           3500                3
1            Steve          29000                4
2            Mitch          10000                9
3             Ryan           2000                5

MINI CHALLENGE #8:
- Using "bank_client_df" DataFrame, leverage pandas operations to only select high networth individuals with minimum $5000 
- What is the combined networth for all customers with 5000+ networth?

In [26]:
bank_client_df = pd.DataFrame({'Bank client ID':[111, 222, 333, 444], 
                               'Bank Client Name':['Chanel', 'Steve', 'Mitch', 'Ryan'], 
                               'Net worth [$]':[3500, 29000, 10000, 2000], 
                               'Years with bank':[3, 4, 9, 5]})

high = bank_client_df[bank_client_df['Net worth [$]']>=5000]
high['Net worth [$]'].sum()

39000

# TASK #9: PANDAS WITH FUNCTIONS

In [13]:
# Let's define a dataframe as follows:
bank_client_df = pd.DataFrame({'Bank client ID':[111, 222, 333, 444], 
                               'Bank Client Name':['Chanel', 'Steve', 'Mitch', 'Ryan'], 
                               'Net worth [$]':[3500, 29000, 10000, 2000], 
                               'Years with bank':[3, 4, 9, 5]})
bank_client_df

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
0             111           Chanel           3500                3
1             222            Steve          29000                4
2             333            Mitch          10000                9
3             444             Ryan           2000                5

In [27]:
# Define a function that increases all clients networth (stocks) by a fixed value of 20% (for simplicity sake) 
def increase_percent(saldo):
    return saldo * 1.2

In [28]:
# You can apply a function to the DataFrame 
bank_client_df['Net worth [$]'].apply(increase_percent)

0     4200.0
1    34800.0
2    12000.0
3     2400.0
Name: Net worth [$], dtype: float64

In [29]:
def triple_plus_cash(price):
    return (price*3)+200

MINI CHALLENGE #9:
- Define a function that triples the stock prices and adds $200
- Apply the function to the DataFrame
- Calculate the updated total networth of all clients combined

In [31]:
portfolio_df = pd.DataFrame({'Stock Name': ['Apple', 'Advanced Micro Devices','Amazon',"Tesla"],
                            'Symbol':['AAPL', 'AMD', 'AMZN', 'TSLA'],
                             'Quantity':[5, 2, 3, 5],
                        'Last Price[$]': [159.25, 98.82, 97.32, 190.50],
                        'Share Volume':[6.472, 8.570, 8.095, 16.676]})

activos = portfolio_df['Last Price[$]']*portfolio_df['Quantity']
portfolio_value = activos.sum()
total_allshare = portfolio_df['Share Volume'].sum()
total_allshare
portfolio_df['Last Price[$]'].apply(triple_plus_cash)

0    677.75
1    496.46
2    491.96
3    771.50
Name: Last Price[$], dtype: float64

# TASK #10: PERFORM SORTING AND ORDERING IN PANDAS

In [ ]:
# Let's define a dataframe as follows:
bank_client_df = pd.DataFrame({'Bank client ID':[111, 222, 333, 444], 
                               'Bank Client Name':['Chanel', 'Steve', 'Mitch', 'Ryan'], 
                               'Net worth [$]':[3500, 29000, 10000, 2000], 
                               'Years with bank':[3, 4, 9, 5]})
bank_client_df

In [38]:
# You can sort the values in the dataframe according to number of years with bank
#bank_client_df.sort_values(by = 'Years with bank')
bank_client_df.sort_values(['Years with bank'])

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
0             111           Chanel           3500                3
1             222            Steve          29000                4
3             444             Ryan           2000                5
2             333            Mitch          10000                9

In [39]:
# Note that nothing changed in memory! you have to make sure that inplace is set to True
bank_client_df.sort_values(['Years with bank'], inplace = True)

In [41]:
# Set inplace = True to ensure that change has taken place in memory 
bank_client_df

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
0             111           Chanel           3500                3
1             222            Steve          29000                4
3             444             Ryan           2000                5
2             333            Mitch          10000                9

In [ ]:
# Note that now the change (ordering) took place

# TASK #11: PERFORM CONCATENATING AND MERGING WITH PANDAS

In [ ]:
# Check this out: https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

In [42]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index = [0,1,2,3])

In [43]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [45]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index = [4,5,6,7])

In [46]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [48]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                   index = [8,9,10,11])

In [49]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [50]:
pd.concat([df1,df2,df2])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

# TASK #12: PROJECT AND CONCLUDING REMARKS

- Define a dataframe named 'Bank_df_1' that contains the first and last names for 5 bank clients with IDs = 1, 2, 3, 4, 5 
- Assume that the bank got 5 new clients, define another dataframe named 'Bank_df_2' that contains a new clients with IDs = 6, 7, 8, 9, 10
- Let's assume we obtained additional information (Annual Salary) about all our bank customers (10 customers) 
- Concatenate both 'bank_df_1' and 'bank_df_2' dataframes
- Merge client names and their newly added salary information using the 'Bank Client ID'
- Let's assume that you became a new client to the bank
- Define a new DataFrame that contains your information such as client ID (choose 11), first name, last name, and annual salary.
- Add this new dataframe to the original dataframe 'bank_df_all'.

# EXCELLENT JOB!

# MINI CHALLENGES SOLUTIONS

MINI CHALLENGE #1 SOLUTION: 
- Write a code that creates the following 2x4 numpy array

```
[[3 7 9 3] 
[4 3 2 2]]
```

In [ ]:
x = np.array([[[3, 7, 9, 3] , [4, 3, 2, 2]]])
x

MINI CHALLENGE #2 SOLUTION:
- Write a code that takes in a positive integer "x" from the user and creates a 1x10 array with random numbers ranging from 0 to "x"

In [ ]:
x = int(input("Please enter a positive integer value: "))
x = np.random.randint(1, x, 10)
x

MINI CHALLENGE #3 SOLUTION:
- Given the X and Y values below, obtain the distance between them


```
X = [5, 7, 20]
Y = [9, 15, 4]
```

In [ ]:
X = np.array([5, 7, 20])
Y = np.array([9, 15, 4])
Z = np.sqrt(X**2 + Y**2)
Z

MINI CHALLENGE #4 SOLUTION:
- In the following matrix, replace the last row with 0

```
X = [2 30 20 -2 -4]
    [3 4  40 -3 -2]
    [-3 4 -6 90 10]
    [25 45 34 22 12]
    [13 24 22 32 37]
```

In [ ]:
X = np.array([[2, 30, 20, -2, -4],
    [3, 4,  40, -3, -2],
    [-3, 4, -6, 90, 10],
    [25, 45, 34, 22, 12],
    [13, 24, 22, 32, 37]])

In [ ]:
X[4] = 0
X

MINI CHALLENGE #5 SOLUTION:
- In the following matrix, replace negative elements by 0 and replace odd elements with -2


```
X = [2 30 20 -2 -4]
    [3 4  40 -3 -2]
    [-3 4 -6 90 10]
    [25 45 34 22 12]
    [13 24 22 32 37]
```

In [ ]:
X = np.array([[2, 30, 20, -2, -4],
    [3, 4,  40, -3, -2],
    [-3, 4, -6, 90, 10],
    [25, 45, 34, 22, 12],
    [13, 24, 22, 32, 37]])

X[X<0] = 0
X[X%2==1] = -2
X

MINI CHALLENGE #6 SOLUTION:
- A porfolio contains a collection of securities such as stocks, bonds and ETFs. Define a dataframe named 'portfolio_df' that holds 3 different stock ticker symbols, number of shares, and price per share (feel free to choose any stocks)
- Calculate the total value of the porfolio including all stocks

In [ ]:
portfolio_df = pd.DataFrame({'stock ticker symbols':['AAPL', 'AMZN', 'T'],
                             'price per share [$]':[3500, 200, 40], 
                             'Number of stocks':[3, 4, 9]})
portfolio_df

In [ ]:
stocks_dollar_value = portfolio_df['price per share [$]'] * portfolio_df['Number of stocks']
print(stocks_dollar_value)
print('Total portfolio value = {}'.format(stocks_dollar_value.sum()))

MINI CHALLENGE #7 SOLUTION:
- Write a code that uses Pandas to read tabular US retirement data
- You can use data from here: https://www.ssa.gov/oact/progdata/nra.html

In [ ]:
# Read tabular data using read_html
retirement_age_df = pd.read_html('https://www.ssa.gov/oact/progdata/nra.html')
retirement_age_df

MINI CHALLENGE #8 SOLUTION:
- Using "bank_client_df" DataFrame, leverage pandas operations to only select high networth individuals with minimum $5000 
- What is the combined networth for all customers with 5000+ networth?

In [ ]:
df_high_networth = bank_client_df[ (bank_client_df['Net worth [$]'] >= 5000) ]
df_high_networth

In [ ]:
df_high_networth['Net worth [$]'].sum()

MINI CHALLENGE #9 SOLUTION:
- Define a function that triples the stock prices and adds $200
- Apply the function to the DataFrame
- Calculate the updated total networth of all clients combined

In [ ]:
def networth_update(balance):
    return balance * 3 + 200

In [ ]:
# You can apply a function to the DataFrame 
results = bank_client_df['Net worth [$]'].apply(networth_update)
results

In [ ]:
results.sum()

PROJECT SOLUTION:

In [ ]:
# Creating a dataframe from a dictionary
# Let's define a dataframe with a list of bank clients with IDs = 1, 2, 3, 4, 5 

raw_data = {'Bank Client ID': ['1', '2', '3', '4', '5'],
            'First Name': ['Nancy', 'Alex', 'Shep', 'Max', 'Allen'], 
            'Last Name': ['Rob', 'Ali', 'George', 'Mitch', 'Steve']}

Bank_df_1 = pd.DataFrame(raw_data, columns = ['Bank Client ID', 'First Name', 'Last Name'])
Bank_df_1


# Let's define another dataframe for a separate list of clients (IDs = 6, 7, 8, 9, 10)
raw_data = {
        'Bank Client ID': ['6', '7', '8', '9', '10'],
        'First Name': ['Bill', 'Dina', 'Sarah', 'Heather', 'Holly'], 
        'Last Name': ['Christian', 'Mo', 'Steve', 'Bob', 'Michelle']}
Bank_df_2 = pd.DataFrame(raw_data, columns = ['Bank Client ID', 'First Name', 'Last Name'])
Bank_df_2


# Let's assume we obtained additional information (Annual Salary) about our bank customers 
# Note that data obtained is for all clients with IDs 1 to 10 
raw_data = {
        'Bank Client ID': ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10'],
        'Annual Salary [$/year]': [25000, 35000, 45000, 48000, 49000, 32000, 33000, 34000, 23000, 22000]}
bank_df_salary = pd.DataFrame(raw_data, columns = ['Bank Client ID','Annual Salary [$/year]'])
bank_df_salary


# Let's concatenate both dataframes #1 and #2
# Note that we now have client IDs from 1 to 10
bank_df_all = pd.concat([Bank_df_1, Bank_df_2])
bank_df_all


# Let's merge all data on 'Bank Client ID'
bank_df_all = pd.merge(bank_df_all, bank_df_salary, on = 'Bank Client ID')
bank_df_all

In [ ]:
new_client = {
        'Bank Client ID': ['11'],
        'First Name': ['Ry'], 
        'Last Name': ['Aly'],
        'Annual Salary [$/year]' : [1000]}
new_client_df = pd.DataFrame(new_client, columns = ['Bank Client ID', 'First Name', 'Last Name', 'Annual Salary [$/year]'])
new_client_df

In [ ]:
new_df = pd.concat([bank_df_all, new_client_df], axis = 0)
new_df